{
  "facts": [
    {
      "summary": "premier bug informatique mite papillon 1947 harvard mark ii grace hopper",
      "full": "Le premier bug informatique documenté remonte à 1947, lorsque des ingénieurs travaillant sur l'ordinateur Mark II à l'Université Harvard ont découvert une mite coincée dans l'un des composants.",
      "date_used": "2026-01-20T08:00:00"
    },
    {
      "summary": "Easter egg Excel 97 simulateur de vol",
      "full": "Dans Excel 97, les développeurs ont caché un simulateur de vol entièrement fonctionnel. Pour y accéder, il suffisait de suivre une série d'étapes spécifiques dans le logiciel, révélant ainsi un easter egg surprenant au sein d'une application de tableur.",
      "date_used": "2026-01-20T17:05:44.435217"
    },
    {
      "summary": "premier bug informatique mite papillon 1947 harvard mark ii grace hopper",
      "full": "Le terme 'bug' en informatique provient d'un incident survenu en 1947, lorsque des ingénieurs travaillant sur l'ordinateur Mark II à l'Université de Harvard ont trouvé un papillon coincé dans le matériel, provoquant un dysfonctionnement. Cet événement a été documenté par Grace Hopper, qui a collé le papillon dans le journal de bord, marquant ainsi l'origine du terme 'bug' pour désigner une erreur technique.",
      "date_used": "2026-01-22T08:00:00"
    },
    {
      "summary": "origine du terme bug Grace Hopper 1947",
      "full": "Le terme \"bug\" en informatique a été popularisé par Grace Hopper dans les années 1940, lorsqu'un véritable papillon a été trouvé coincé dans un relais de l'ordinateur Harvard Mark II, provoquant une panne. Cet incident a été documenté dans le journal de bord de l'ordinateur, marquant ainsi l'origine du terme \"bug\" pour désigner une erreur technique.",
      "date_used": "2026-01-23T07:28:23.707080"
    },
    {
      "summary": "premier easter egg logiciel 1967 PDP-10",
      "full": "Le premier Easter egg connu dans un logiciel a été intégré dans la commande 'make' des ordinateurs PDP-10 entre octobre 1967 et octobre 1968. Ce Easter egg a été conçu par les programmeurs pour prouver que le code avait été volé si quelqu'un tentait de le réemballer comme étant le sien.",
      "date_used": "2026-01-26T07:30:41.884439"
    },
    {
      "summary": "bug Therac-25 radiation overdose",
      "full": "Le bug Therac-25 est l'un des incidents les plus tragiques de l'histoire de l'informatique. Ce logiciel, utilisé pour administrer des traitements de radiothérapie, a causé des surdoses mortelles de radiation à des patients en raison de défauts de programmation. Entre 1985 et 1987, plusieurs patients ont été gravement blessés, et certains sont décédés à cause de ce bug, soulignant l'importance cruciale de la vérification des logiciels dans des applications médicales.",
      "date_used": "2026-01-27T07:30:06.790968"
    },
    {
      "summary": "premier easter egg Atari 1979 Warren Robinett",
      "full": "Le premier easter egg de l'histoire du jeu vidéo a été créé en 1979 par Warren Robinett, un développeur chez Atari. Ce secret, caché dans le jeu \"Adventure\", permettait aux joueurs de découvrir un message caché qui révélait le nom de l'auteur du jeu, une pratique rare à l'époque.",
      "date_used": "2026-01-28T07:29:33.687563"
    },
    {
      "summary": "bug Ariane 5 1996",
      "full": "Le 4 juin 1996, la fusée Ariane 5 a explosé 37 secondes après son lancement en raison d'un bug dans son logiciel de contrôle. Ce bug était dû à une conversion de données incorrecte entre deux systèmes, entraînant une surcharge de données. Cet incident a coûté environ 500 millions de dollars et a conduit à des révisions majeures des protocoles de test et de validation dans l'industrie spatiale.",
      "date_used": "2026-01-29T07:41:45.181022"
    },
    {
      "summary": "origine du nom Python langage de programmation Monty Python",
      "full": "Le langage de programmation Python a été créé par Guido van Rossum à la fin des années 1980 et a été nommé d'après la série télévisée britannique \"Monty Python's Flying Circus\". Van Rossum voulait un nom qui soit à la fois court, unique et un peu mystérieux, et il était fan de l'humour absurde de cette série.",
      "date_used": "2026-01-30T07:43:18.631681"
    },
    {
      "summary": "premier virus informatique Creeper 1971",
      "full": "Le premier virus informatique, nommé \"Creeper\", a été créé en 1971 par un programmeur nommé Bob Thomas. Ce virus infectait le réseau ARPANET et était conçu pour se propager d'un ordinateur à l'autre, affichant le message : \"Je suis Creeper, attrapez-moi si vous le pouvez !\".",
      "date_used": "2026-02-02T07:53:23.606683"
    },
    {
      "summary": "Y2K bug millennium bug",
      "full": "Le bug de l'an 2000, également connu sous le nom de Y2K, était une préoccupation majeure à l'approche de l'an 2000. Les systèmes informatiques, qui utilisaient souvent un format d'année à deux chiffres, risquaient de mal interpréter la date de transition du 31 décembre 1999 au 1er janvier 2000, ce qui aurait pu entraîner des pannes massives dans divers secteurs. Heureusement, grâce à des efforts de mise à jour et de test, la plupart des problèmes ont été évités.",
      "date_used": "2026-02-04T07:45:54.814867"
    }
  ]
}